Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
                    = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_libraries_layer:60",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_modules_layer:28",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getInfo.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "408999661423107110" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1738034154077949000" -> "1755653918640242000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getMap.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getMap"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_libraries_layer:60",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_modules_layer:28",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getMap.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "68600184525849919" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1733455535890647000" -> "1755653919977999000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getProjects.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getProjects"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_libraries_layer:60",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_modules_layer:28",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getProjects.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "6855649956132026278" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1739862262583653000" -> "1755653918259867000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getRuns.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getRuns"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_libraries_layer:60",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_modules_layer:28",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getRuns.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "5876322126418722196" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1755151178129779200" -> "1755653918736881000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-indexer.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-indexer"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_libraries_layer:60",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_modules_layer:28",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-indexer.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "5941931916905823461" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1747627139826107000" -> "1755653917882135000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-performQuery.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-performQuery"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_binaries_layer:56",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_libraries_layer:60",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_modules_layer:28",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-performQuery.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "971407127170108166" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1742271411147811000" -> "1755653918852569200"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-splitQuery.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-splitQuery"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_libraries_layer:60",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_modules_layer:28",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-splitQuery.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "8717229546887750898" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1742271411208420000" -> "1755653918847076800"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-submitDataset.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-submitDataset"
      ~ image_uri                      = "307946671795.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers@sha256:f7a630e937949ca54adabc172c535b6cd1db3f8d11c1b4a723ef71e916b9d529" -> (known after apply)
      ~ last_modified                  = "2025-08-14T06:10:08.000+0000" -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (26 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-updateFiles.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-updateFiles"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_binaries_layer:56",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_libraries_layer:60",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_modules_layer:28",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-updateFiles.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "4692618949431864834" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1755151176712055000" -> "1755653917730973000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.python_libraries_layer.aws_lambda_layer_version.this[0] must be replaced
+/- resource "aws_lambda_layer_version" "this" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_libraries_layer:60" -> (known after apply)
      ~ code_sha256                 = "qj+sfSTfbdmb2V1/sPDrufoV9UATLBV5oINAx4CA31I=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-08-14T06:27:33.024+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_libraries_layer:60" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_libraries_layer" -> (known after apply)
      ~ s3_key                      = "builds/6bb62ab7e7840aeec06cd02db4212333580f8b7a769a6f71306bdbf4461cb29a.zip" -> "builds/7c36a983018986789626cbf4375ddd9f0385fab0f3d2c8606f9dff3f7d7aab8f.zip" # forces replacement
      + s3_object_version           = (known after apply) # forces replacement
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + source_code_hash            = (known after apply)
      ~ source_code_size            = 24397232 -> (known after apply)
      ~ version                     = "60" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_libraries_layer.aws_s3_object.lambda_package[0] must be replaced
+/- resource "aws_s3_object" "lambda_package" {
      ~ arn                           = "arn:aws:s3:::gaspi-lambda-layers-20250725041417117200000004/builds/6bb62ab7e7840aeec06cd02db4212333580f8b7a769a6f71306bdbf4461cb29a.zip" -> (known after apply)
      ~ bucket_key_enabled            = false -> (known after apply)
      + checksum_crc32                = (known after apply)
      + checksum_crc32c               = (known after apply)
      + checksum_crc64nvme            = (known after apply)
      + checksum_sha1                 = (known after apply)
      + checksum_sha256               = (known after apply)
      ~ content_type                  = "binary/octet-stream" -> (known after apply)
      ~ etag                          = "15fa573bff4169904bca5ba2475ffbb7-5" -> (known after apply)
      ~ id                            = "builds/6bb62ab7e7840aeec06cd02db4212333580f8b7a769a6f71306bdbf4461cb29a.zip" -> (known after apply)
      ~ key                           = "builds/6bb62ab7e7840aeec06cd02db4212333580f8b7a769a6f71306bdbf4461cb29a.zip" -> "builds/7c36a983018986789626cbf4375ddd9f0385fab0f3d2c8606f9dff3f7d7aab8f.zip" # forces replacement
      + kms_key_id                    = (known after apply)
      - metadata                      = {} -> null
      ~ server_side_encryption        = "AES256" -> (known after apply)
      ~ source                        = "builds/6bb62ab7e7840aeec06cd02db4212333580f8b7a769a6f71306bdbf4461cb29a.zip" -> "builds/7c36a983018986789626cbf4375ddd9f0385fab0f3d2c8606f9dff3f7d7aab8f.zip"
      - tags                          = {} -> null
      + version_id                    = (known after apply)
        # (14 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_libraries_layer.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/layers/python_libraries/",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/7c36a983018986789626cbf4375ddd9f0385fab0f3d2c8606f9dff3f7d7aab8f.zip"
              + runtime       = ""
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/7c36a983018986789626cbf4375ddd9f0385fab0f3d2c8606f9dff3f7d7aab8f.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.python_libraries_layer.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "7120633147001000643" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/6bb62ab7e7840aeec06cd02db4212333580f8b7a769a6f71306bdbf4461cb29a.zip" -> "builds/7c36a983018986789626cbf4375ddd9f0385fab0f3d2c8606f9dff3f7d7aab8f.zip"
          ~ "timestamp" = "1755152819636400000" -> "1755653932219065000"
        }
    }

  # module.sbeacon.module.python_modules_layer.aws_lambda_layer_version.this[0] must be replaced
+/- resource "aws_lambda_layer_version" "this" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_modules_layer:28" -> (known after apply)
      ~ code_sha256                 = "5aC0/TKOs9X+Xw7KRcTuRL2KvF2/AwhJPaNNf48biC8=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-08-14T06:01:53.514+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_modules_layer:28" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_modules_layer" -> (known after apply)
      ~ s3_key                      = "builds/60860b433c625a698dbae872d0f311b06bf12af21960fe780f7c9f43f8b92b52.zip" -> "builds/139522c728ea1ff05ded82c42d3d483fa43064180a3a66ab50bb8efc8d648d9d.zip" # forces replacement
      + s3_object_version           = (known after apply) # forces replacement
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + source_code_hash            = (known after apply)
      ~ source_code_size            = 39435 -> (known after apply)
      ~ version                     = "28" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_modules_layer.aws_s3_object.lambda_package[0] must be replaced
+/- resource "aws_s3_object" "lambda_package" {
      ~ arn                           = "arn:aws:s3:::gaspi-lambda-layers-20250725041417117200000004/builds/60860b433c625a698dbae872d0f311b06bf12af21960fe780f7c9f43f8b92b52.zip" -> (known after apply)
      ~ bucket_key_enabled            = false -> (known after apply)
      + checksum_crc32                = (known after apply)
      + checksum_crc32c               = (known after apply)
      + checksum_crc64nvme            = (known after apply)
      + checksum_sha1                 = (known after apply)
      + checksum_sha256               = (known after apply)
      ~ content_type                  = "application/octet-stream" -> (known after apply)
      ~ etag                          = "bc8a0e0ff5dd1ebbad8f5dc1e455be5c" -> (known after apply)
      ~ id                            = "builds/60860b433c625a698dbae872d0f311b06bf12af21960fe780f7c9f43f8b92b52.zip" -> (known after apply)
      ~ key                           = "builds/60860b433c625a698dbae872d0f311b06bf12af21960fe780f7c9f43f8b92b52.zip" -> "builds/139522c728ea1ff05ded82c42d3d483fa43064180a3a66ab50bb8efc8d648d9d.zip" # forces replacement
      + kms_key_id                    = (known after apply)
      - metadata                      = {} -> null
      ~ server_side_encryption        = "AES256" -> (known after apply)
      ~ source                        = "builds/60860b433c625a698dbae872d0f311b06bf12af21960fe780f7c9f43f8b92b52.zip" -> "builds/139522c728ea1ff05ded82c42d3d483fa43064180a3a66ab50bb8efc8d648d9d.zip"
      - tags                          = {} -> null
      + version_id                    = (known after apply)
        # (14 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_modules_layer.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/shared_resources/python-modules/",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/139522c728ea1ff05ded82c42d3d483fa43064180a3a66ab50bb8efc8d648d9d.zip"
              + runtime       = ""
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/139522c728ea1ff05ded82c42d3d483fa43064180a3a66ab50bb8efc8d648d9d.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.python_modules_layer.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "7509036302617809688" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/60860b433c625a698dbae872d0f311b06bf12af21960fe780f7c9f43f8b92b52.zip" -> "builds/139522c728ea1ff05ded82c42d3d483fa43064180a3a66ab50bb8efc8d648d9d.zip"
          ~ "timestamp" = "1755151177374203000" -> "1755653918069724000"
        }
    }

  # module.security.module.lambda-sendSecurityAlert.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "2741618623640032437" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1747627139010521000" -> "1755653918841374000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.docker_image_pluginConsequence_lambda.docker_image.this must be replaced
+/- resource "docker_image" "this" {
      ~ id           = "sha256:4f0b86ad1e29141ca9f968143d2cd6304ab7f6f98a877a6ac5c2d5bab8c489cf307946671795.dkr.ecr.ap-southeast-3.amazonaws.com/svep-pluginconsequence-lambda-containers" -> (known after apply)
      ~ image_id     = "sha256:4f0b86ad1e29141ca9f968143d2cd6304ab7f6f98a877a6ac5c2d5bab8c489cf" -> (known after apply)
        name         = "307946671795.dkr.ecr.ap-southeast-3.amazonaws.com/svep-pluginconsequence-lambda-containers"
      + repo_digest  = (known after apply)
      ~ triggers     = { # forces replacement
          ~ "dir_sha" = "9ef19daadb452fae832dec6aa1718a18db887955" -> "b0edbf057326948fa47af0299509fbea8ae0120b"
        }
        # (2 unchanged attributes hidden)

      - build {
          - build_args      = {} -> null
          - cache_from      = [] -> null
          - context         = "svep/lambda/pluginConsequence" -> null
          - cpu_period      = 0 -> null
          - cpu_quota       = 0 -> null
          - cpu_shares      = 0 -> null
          - dockerfile      = "Dockerfile" -> null
          - extra_hosts     = [] -> null
          - force_remove    = false -> null
          - label           = {} -> null
          - labels          = {} -> null
          - memory          = 0 -> null
          - memory_swap     = 0 -> null
          - no_cache        = false -> null
          - platform        = "linux/amd64" -> null
          - pull_parent     = false -> null
          - remove          = true -> null
          - security_opt    = [] -> null
          - shm_size        = 0 -> null
          - squash          = false -> null
          - suppress_output = false -> null
          - tag             = [] -> null
            # (12 unchanged attributes hidden)
        }
      + build {
          + cache_from     = []
          + context        = "svep/lambda/pluginConsequence"
          + dockerfile     = "Dockerfile"
          + extra_hosts    = []
          + platform       = "linux/amd64"
          + remove         = true
          + security_opt   = []
          + tag            = []
            # (12 unchanged attributes hidden)
        }
    }

  # module.svep[0].module.docker_image_pluginConsequence_lambda.docker_registry_image.this must be replaced
+/- resource "docker_registry_image" "this" {
      ~ id                   = "sha256:a9871ee1bafe4d98f3eff42e0f16299714f556fb3dc93c3e0445f57f34edce54" -> (known after apply)
        name                 = "307946671795.dkr.ecr.ap-southeast-3.amazonaws.com/svep-pluginconsequence-lambda-containers"
      ~ sha256_digest        = "sha256:a9871ee1bafe4d98f3eff42e0f16299714f556fb3dc93c3e0445f57f34edce54" -> (known after apply)
      ~ triggers             = { # forces replacement
          ~ "dir_sha" = "9ef19daadb452fae832dec6aa1718a18db887955" -> "b0edbf057326948fa47af0299509fbea8ae0120b"
        }
        # (2 unchanged attributes hidden)
    }

  # module.svep[0].module.docker_image_qcFigures_lambda.docker_image.this must be replaced
+/- resource "docker_image" "this" {
      ~ id           = "sha256:bd3865b9b042bf0ecf5779243d9aed39222ed96f58c2b9ea8b4e33fa624204af307946671795.dkr.ecr.ap-southeast-3.amazonaws.com/svep-qcfigures-lambda-containers" -> (known after apply)
      ~ image_id     = "sha256:bd3865b9b042bf0ecf5779243d9aed39222ed96f58c2b9ea8b4e33fa624204af" -> (known after apply)
        name         = "307946671795.dkr.ecr.ap-southeast-3.amazonaws.com/svep-qcfigures-lambda-containers"
      + repo_digest  = (known after apply)
      ~ triggers     = { # forces replacement
          ~ "dir_sha" = "f4642a4c9fa102ba337e710c6a680fe8f81862e5" -> "7e966d35e73a1ac16df77bcf7a849c6825d9b9a2"
        }
        # (2 unchanged attributes hidden)

      - build {
          - build_args      = {
              - "SHARED_LAYER_PATH" = "svep/shared_resources/python-modules/python/shared"
            } -> null
          - cache_from      = [] -> null
          - context         = "svep/lambda/qcFigures" -> null
          - cpu_period      = 0 -> null
          - cpu_quota       = 0 -> null
          - cpu_shares      = 0 -> null
          - dockerfile      = "Dockerfile" -> null
          - extra_hosts     = [] -> null
          - force_remove    = false -> null
          - label           = {} -> null
          - labels          = {} -> null
          - memory          = 0 -> null
          - memory_swap     = 0 -> null
          - no_cache        = false -> null
          - platform        = "linux/amd64" -> null
          - pull_parent     = false -> null
          - remove          = true -> null
          - security_opt    = [] -> null
          - shm_size        = 0 -> null
          - squash          = false -> null
          - suppress_output = false -> null
          - tag             = [] -> null
            # (12 unchanged attributes hidden)
        }
      + build {
          + build_args     = {
              + "SHARED_LAYER_PATH" = "svep/shared_resources/python-modules/python/shared"
            }
          + cache_from     = []
          + context        = "svep/lambda/qcFigures"
          + dockerfile     = "Dockerfile"
          + extra_hosts    = []
          + platform       = "linux/amd64"
          + remove         = true
          + security_opt   = []
          + tag            = []
            # (12 unchanged attributes hidden)
        }
    }

  # module.svep[0].module.docker_image_qcFigures_lambda.docker_registry_image.this must be replaced
+/- resource "docker_registry_image" "this" {
      ~ id                   = "sha256:2c0fd2e95cb5c209db42d7042af19f9fe84f11a30c6385325b1f3482cc735610" -> (known after apply)
        name                 = "307946671795.dkr.ecr.ap-southeast-3.amazonaws.com/svep-qcfigures-lambda-containers"
      ~ sha256_digest        = "sha256:2c0fd2e95cb5c209db42d7042af19f9fe84f11a30c6385325b1f3482cc735610" -> (known after apply)
      ~ triggers             = { # forces replacement
          ~ "dir_sha" = "f4642a4c9fa102ba337e710c6a680fe8f81862e5" -> "7e966d35e73a1ac16df77bcf7a849c6825d9b9a2"
        }
        # (2 unchanged attributes hidden)
    }

  # module.svep[0].module.lambda-batchStarter.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-batchStarter"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_python_modules_layer:55",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-batchStarter.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "7636266452508359202" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1755151183624802200" -> "1755653932546853000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-batchSubmit.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-batchSubmit"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_python_modules_layer:55",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-batchSubmit.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "937286691161656110" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1755151183665365000" -> "1755653931430096000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-clearTempAndRegions.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "8752627037143596" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1755151183060875000" -> "1755653932668228000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-concat.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-concat"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_python_modules_layer:55",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-concat.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "736192432559336944" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1755151182429382000" -> "1755653932936819000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-concatPages.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-concatPages"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_python_modules_layer:55",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-concatPages.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "2584339441863057772" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1755151182898576000" -> "1755653931662364000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-concatStarter.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-concatStarter"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_python_modules_layer:55",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-concatStarter.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "2381138834128586910" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1755151182099802000" -> "1755653932274094200"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-createPages.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-createPages"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_python_modules_layer:55",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-createPages.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "7560720713719009529" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1755151183047645000" -> "1755653931765599000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-deleteClinicalWorkflow.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-deleteClinicalWorkflow"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_binaries_layer:50",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_python_modules_layer:55",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-deleteClinicalWorkflow.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "446500302908758275" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1755151183083313000" -> "1755653932220395000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-formatOutput.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/bad3415550ced4a6beaf9659c18f8ea3225f37792fd8d8e61e5e833d4706a45a.zip" -> "builds/d32aa35cf57e53659b0e754bc93969b96076848d58eceef4e148d1c987a85729.zip"
        id                             = "svep-backend-formatOutput"
      ~ last_modified                  = "2025-08-14T07:16:07.443+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_python_modules_layer:55",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (26 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-formatOutput.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "svep/lambda/formatOutput",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/d32aa35cf57e53659b0e754bc93969b96076848d58eceef4e148d1c987a85729.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/d32aa35cf57e53659b0e754bc93969b96076848d58eceef4e148d1c987a85729.plan.json"
      + id                   = (known after apply)
    }

  # module.svep[0].module.lambda-formatOutput.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "8835819379357002275" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/bad3415550ced4a6beaf9659c18f8ea3225f37792fd8d8e61e5e833d4706a45a.zip" -> "builds/d32aa35cf57e53659b0e754bc93969b96076848d58eceef4e148d1c987a85729.zip"
          ~ "timestamp" = "1755151182911532000" -> "1755653932520903200"
        }
    }

  # module.svep[0].module.lambda-getResultsURL.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-getResultsURL"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_python_modules_layer:55",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-getResultsURL.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "7957434883271084983" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1755151182770760000" -> "1755653932438605000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-initQuery.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-initQuery"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_binaries_layer:50",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_python_modules_layer:55",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-initQuery.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "3898924098298319367" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1755151181406727000" -> "1755653932376314000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-pluginClinvar.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-pluginClinvar"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_binaries_layer:50",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_python_modules_layer:55",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-pluginClinvar.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "3756939270191667422" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1755151183055020000" -> "1755653931635915000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-pluginConsequence.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-pluginConsequence"
      ~ image_uri                      = "307946671795.dkr.ecr.ap-southeast-3.amazonaws.com/svep-pluginconsequence-lambda-containers@sha256:a9871ee1bafe4d98f3eff42e0f16299714f556fb3dc93c3e0445f57f34edce54" -> (known after apply)
      ~ last_modified                  = "2025-08-14T06:11:10.735+0000" -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (26 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-pluginGnomad.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-pluginGnomad"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_binaries_layer:50",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_python_modules_layer:55",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-pluginGnomad.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1100344033069035846" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1755151182911000000" -> "1755653932483302200"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-pluginGnomadConstraint.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-pluginGnomadConstraint"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_binaries_layer:50",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_python_modules_layer:55",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-pluginGnomadConstraint.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "8818450631032019581" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1755151183276695000" -> "1755653932065739000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-pluginGnomadOneKG.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/1bbca2f0065dc117132bea72e9ecf2b8f7f5ccf0e44856b171832a7edca01727.zip" -> "builds/12a7d26d1fa7f85cdd48ea1119e4d6463a8cd46e01831600db5b2431337cd75e.zip"
        id                             = "svep-backend-pluginGnomadOneKG"
      ~ last_modified                  = "2025-08-14T07:16:39.008+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_binaries_layer:50",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_python_modules_layer:55",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (26 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-pluginGnomadOneKG.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "svep/lambda/pluginGnomadOneKG",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/12a7d26d1fa7f85cdd48ea1119e4d6463a8cd46e01831600db5b2431337cd75e.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/12a7d26d1fa7f85cdd48ea1119e4d6463a8cd46e01831600db5b2431337cd75e.plan.json"
      + id                   = (known after apply)
    }

  # module.svep[0].module.lambda-pluginGnomadOneKG.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "8174099183777263380" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/1bbca2f0065dc117132bea72e9ecf2b8f7f5ccf0e44856b171832a7edca01727.zip" -> "builds/12a7d26d1fa7f85cdd48ea1119e4d6463a8cd46e01831600db5b2431337cd75e.zip"
          ~ "timestamp" = "1755151183672089000" -> "1755653932752306000"
        }
    }

  # module.svep[0].module.lambda-qcFigures.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-qcFigures"
      ~ image_uri                      = "307946671795.dkr.ecr.ap-southeast-3.amazonaws.com/svep-qcfigures-lambda-containers@sha256:2c0fd2e95cb5c209db42d7042af19f9fe84f11a30c6385325b1f3482cc735610" -> (known after apply)
      ~ last_modified                  = "2025-08-14T06:10:07.528+0000" -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (26 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-qcNotes.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-qcNotes"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_python_modules_layer:55",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-qcNotes.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "7966899873493005570" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1755151182329133000" -> "1755653931933654000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-queryGTF.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-queryGTF"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_binaries_layer:50",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_python_modules_layer:55",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-queryGTF.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1346484834967139350" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1755151181678433800" -> "1755653931874808000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-queryVCF.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-queryVCF"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_binaries_layer:50",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_python_modules_layer:55",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-queryVCF.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "7580974424620520821" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1755151181394507800" -> "1755653931631166000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-queryVCFsubmit.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-queryVCFsubmit"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_python_modules_layer:55",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-queryVCFsubmit.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "5235825063027391715" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1755151182376398000" -> "1755653932687255000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-sendJobEmail.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-sendJobEmail"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_binaries_layer:50",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_python_modules_layer:55",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-sendJobEmail.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "2995981044346890554" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1755151181607506000" -> "1755653932566279000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-updateReferenceFiles.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-updateReferenceFiles"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_binaries_layer:50",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_python_modules_layer:55",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-updateReferenceFiles.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "8217037801808576046" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1755151183558597000" -> "1755653932473985000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.python_modules_layer.aws_lambda_layer_version.this[0] must be replaced
+/- resource "aws_lambda_layer_version" "this" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_python_modules_layer:55" -> (known after apply)
      ~ code_sha256                 = "ItBcwCVdviVbQGWL6Yx+43/3zfs8eMpTjF3sxJL1UpM=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-08-14T06:02:04.704+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_python_modules_layer:55" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_python_modules_layer" -> (known after apply)
      ~ s3_key                      = "builds/3ecea7db4904a8819cc730d8322c21d70be060b8ce1da594c6f18c80b6f917f2.zip" -> "builds/0722941de3bcb74d413e12a9d728aadb19adba111e499a2d821cd802c84b3c72.zip" # forces replacement
      + s3_object_version           = (known after apply) # forces replacement
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + source_code_hash            = (known after apply)
      ~ source_code_size            = 13260 -> (known after apply)
      ~ version                     = "55" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.svep[0].module.python_modules_layer.aws_s3_object.lambda_package[0] must be replaced
+/- resource "aws_s3_object" "lambda_package" {
      ~ arn                           = "arn:aws:s3:::svep-backend-layers-20250814060124462100000005/builds/3ecea7db4904a8819cc730d8322c21d70be060b8ce1da594c6f18c80b6f917f2.zip" -> (known after apply)
      ~ bucket_key_enabled            = false -> (known after apply)
      + checksum_crc32                = (known after apply)
      + checksum_crc32c               = (known after apply)
      + checksum_crc64nvme            = (known after apply)
      + checksum_sha1                 = (known after apply)
      + checksum_sha256               = (known after apply)
      ~ content_type                  = "application/octet-stream" -> (known after apply)
      ~ etag                          = "41184ad271ac5c44bb731791dd128d7f" -> (known after apply)
      ~ id                            = "builds/3ecea7db4904a8819cc730d8322c21d70be060b8ce1da594c6f18c80b6f917f2.zip" -> (known after apply)
      ~ key                           = "builds/3ecea7db4904a8819cc730d8322c21d70be060b8ce1da594c6f18c80b6f917f2.zip" -> "builds/0722941de3bcb74d413e12a9d728aadb19adba111e499a2d821cd802c84b3c72.zip" # forces replacement
      + kms_key_id                    = (known after apply)
      - metadata                      = {} -> null
      ~ server_side_encryption        = "AES256" -> (known after apply)
      ~ source                        = "builds/3ecea7db4904a8819cc730d8322c21d70be060b8ce1da594c6f18c80b6f917f2.zip" -> "builds/0722941de3bcb74d413e12a9d728aadb19adba111e499a2d821cd802c84b3c72.zip"
      - tags                          = {} -> null
      ~ tags_all                      = {} -> (known after apply)
      + version_id                    = (known after apply)
        # (13 unchanged attributes hidden)
    }

  # module.svep[0].module.python_modules_layer.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "svep/shared_resources/python-modules/",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/0722941de3bcb74d413e12a9d728aadb19adba111e499a2d821cd802c84b3c72.zip"
              + runtime       = ""
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/0722941de3bcb74d413e12a9d728aadb19adba111e499a2d821cd802c84b3c72.plan.json"
      + id                   = (known after apply)
    }

  # module.svep[0].module.python_modules_layer.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1065876045715158329" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/3ecea7db4904a8819cc730d8322c21d70be060b8ce1da594c6f18c80b6f917f2.zip" -> "builds/0722941de3bcb74d413e12a9d728aadb19adba111e499a2d821cd802c84b3c72.zip"
          ~ "timestamp" = "1755151181964548200" -> "1755653931540246000"
        }
    }

Plan: 76 to add, 45 to change, 68 to destroy.

Changes to Outputs:
  ~ admin_login_command  = "aws cognito-idp admin-initiate-auth --user-pool-id ap-southeast-3_l5J5oX5o7 --region ap-southeast-3 --client-id 2o8re3mjme9ire97uta110nubj --auth-flow ADMIN_USER_PASSWORD_AUTH --auth-parameters USERNAME=admin@example.com,PASSWORD=Admin@1234! --output json --query AuthenticationResult.IdToken" -> "aws cognito-idp admin-initiate-auth --user-pool-id ap-southeast-3_l5J5oX5o7 --region ap-southeast-3 --client-id 2o8re3mjme9ire97uta110nubj --auth-flow ADMIN_USER_PASSWORD_AUTH --auth-parameters USERNAME=admin@example.com,PASSWORD=Admin1234! --output json --query AuthenticationResult.IdToken"
  ~ guest_login_command  = "aws cognito-idp admin-initiate-auth --user-pool-id ap-southeast-3_l5J5oX5o7 --region ap-southeast-3 --client-id 2o8re3mjme9ire97uta110nubj --auth-flow ADMIN_USER_PASSWORD_AUTH --auth-parameters USERNAME=guest@example.com,PASSWORD=Guest@Example123! --output json --query AuthenticationResult.IdToken" -> "aws cognito-idp admin-initiate-auth --user-pool-id ap-southeast-3_l5J5oX5o7 --region ap-southeast-3 --client-id 2o8re3mjme9ire97uta110nubj --auth-flow ADMIN_USER_PASSWORD_AUTH --auth-parameters USERNAME=guest@example.com,PASSWORD=Guest1234! --output json --query AuthenticationResult.IdToken"
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "svep-warning-thresholds"
│ but a value was found in file "hub01.tfvars". If you meant to use this
│ value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: hub01-plan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "hub01-plan.out"
✅ Terraform plan created successfully: hub01-plan.out
ℹ️  Plan summary:

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.sbeacon.module.docker_image_submitDataset_lambda.docker_image.this has changed
  ~ resource "docker_image" "this" {
        id           = "sha256:a438c3be00f04a35b8de863da0b93a79e8582fbf47a158c30c073381df1bd480307946671795.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers"
      ~ image_id     = "sha256:a438c3be00f04a35b8de863da0b93a79e8582fbf47a158c30c073381df1bd480" -> "sha256:e2ed06cd8841f60a4c869f37f0a98d4a3bd34bb036096492db2a7ecbf7a34441"
        name         = "307946671795.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers"
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.svep[0].module.docker_image_pluginConsequence_lambda.docker_image.this has changed
  ~ resource "docker_image" "this" {
        id           = "sha256:45dbd3a976a4c5c015d369c788a6fae585104dff80385338d2dec754549afd28307946671795.dkr.ecr.ap-southeast-3.amazonaws.com/svep-pluginconsequence-lambda-containers"
      ~ image_id     = "sha256:45dbd3a976a4c5c015d369c788a6fae585104dff80385338d2dec754549afd28" -> "sha256:4f0b86ad1e29141ca9f968143d2cd6304ab7f6f98a877a6ac5c2d5bab8c489cf"
ℹ️  Cleaning up sensitive files
✅ Cleanup completed
✅ ============================================================
✅ Atlantis plan completed successfully for hub01!

Thank you for using Atlantis Schema Deploy
© June, 2025 GXC Consortium
✅ Main execution completed successfully
ℹ️  Cleaning up sensitive files
✅ Cleanup completed
✅ Script completed successfully
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p gxc-hub01
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis-gxc.xapiens.id/lock?id=GSI-Xapiens-CSIRO%252FBGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p gxc-hub01
  ```

**Note: Objects have changed outside of Terraform**
Plan: 76 to add, 45 to change, 68 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```